In [24]:
from sklearn import datasets
import pandas as pd
import numpy as nmp
import seaborn as sns
import matplotlib.pyplot as plt

In [30]:
df=pd.read_csv('Car_Dataset.csv',usecols=['name','seller_type','fuel','owner','transmission'])

In [31]:
df.head()

                       name    fuel seller_type transmission         owner
0             Maruti 800 AC  Petrol  Individual       Manual   First Owner
1  Maruti Wagon R LXI Minor  Petrol  Individual       Manual   First Owner
2      Hyundai Verna 1.6 SX  Diesel  Individual       Manual   First Owner
3    Datsun RediGO T Option  Petrol  Individual       Manual   First Owner
4     Honda Amaze VX i-DTEC  Diesel  Individual       Manual  Second Owner

In [32]:
df.drop('name',axis=1,inplace=True)

In [33]:
df.head()

     fuel seller_type transmission         owner
0  Petrol  Individual       Manual   First Owner
1  Petrol  Individual       Manual   First Owner
2  Diesel  Individual       Manual   First Owner
3  Petrol  Individual       Manual   First Owner
4  Diesel  Individual       Manual  Second Owner

In [34]:
# With python we can do encoding using lambda or map function
#using map
df['seller_type']=df['seller_type'].map({'Individual':0,'Dealer':2,'Trustmark Dealer':2})

In [36]:
df.sample(5)

        fuel  seller_type transmission                 owner
1815  Petrol            0       Manual           First Owner
1814  Diesel            0       Manual  Fourth & Above Owner
1743  Diesel            2       Manual           First Owner
1436  Petrol            0       Manual           First Owner
4129  Diesel            0       Manual          Second Owner

In [37]:
#using lambda
df['transmission'].value_counts()

transmission
Manual       3892
Automatic     448
Name: count, dtype: int64

In [38]:
df['transmission']=df['transmission'].apply(lambda x: 1 if x=='Manual' else 0)

In [9]:
df.sample(5)

,name,fuel,seller_type,transmission,owner
1743,Tata Indigo CS LX (TDI) BS-III,Diesel,2,1,First Owner
206,Hyundai EON Era Plus Option,Petrol,2,1,First Owner
2291,Mercedes-Benz E-Class E250 CDI Elegance,Diesel,2,0,First Owner
2826,Mahindra Xylo E8 ABS Airbag BSIV,Diesel,0,1,First Owner
3716,Honda Jazz 1.5 S i DTEC,Diesel,2,1,First Owner

# Using scikit learn label and ordinal encoder
✅ Use LabelEncoder for the target variable (y)

✅ Use OrdinalEncoder or LabelEncoder for features with real order (e.g., Low < Medium < High)

✅ Use OneHotEncoder for unordered features like city, color, country, brand, etc.

In [39]:
df_n=pd.read_csv('Car_Dataset.csv',usecols=['name','seller_type','fuel','owner','transmission'])

In [40]:
df_n.drop('name',axis=1,inplace=True)

In [41]:
df.sample(5)

        fuel  seller_type  transmission         owner
3572  Diesel            0             1   First Owner
4103  Petrol            0             1   First Owner
3209  Diesel            0             1   First Owner
1273  Petrol            2             0  Second Owner
88    Petrol            2             1   First Owner

# Applying label encoder

In [42]:
from sklearn.model_selection import train_test_split
X=df.drop('fuel',axis=1)
y=df['fuel']

In [43]:
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.2, random_state=42)

In [44]:
from sklearn.preprocessing import LabelEncoder,OrdinalEncoder

In [45]:
le=LabelEncoder()

In [46]:
y_train_tranf=le.fit_transform(y_train)
y_test_tranf=le.fit_transform(y_test)

In [47]:
y_train_tranf

array([1, 1, 4, ..., 1, 1, 4])

In [48]:
oe=OrdinalEncoder()

In [49]:
X_train_tranf=oe.fit_transform(X_train)
X_test_tranf=oe.fit_transform(X_test)

In [50]:
X_train_tranf

array([[0., 1., 0.],
       [0., 1., 0.],
       [0., 1., 2.],
       ...,
       [1., 1., 0.],
       [0., 1., 0.],
       [0., 1., 0.]])